# MaximumViewCount Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElevationMarker..::..MaximumViewCount Property
ElevationMarker Class See Also
---
The maximum number of views that can be hosted by this ElevationMarker.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public int MaximumViewCount { get; }
```

Visual Basic
---
```text
Public ReadOnly Property MaximumViewCount As Integer
	Get
```

Visual C++
---
```text
public:
property int MaximumViewCount {
	int get ();
}
```

# See Also
ElevationMarker Class
Autodesk.Revit.DB Namespace